import pandas as pd
import pytest


@pytest.fixture
def test_df():
    df = pd.DataFrame({
                "Дата операции": [
                    "01.02.2022 10:00:00",
                    "02.02.2022 11:00:00",
                    "03.02.2022 12:00:00",
                    "04.02.2022 13:00:00",
                    "06.02.2022 15:00:00",
                    "08.02.2022 19:00:00"
                ],
                "Сумма платежа": [-100, -200, -300, -500, -1000, 2000],
                "Статус": ["OK", "FAILED", "OK", "OK", "OK", "FAILED"],
                "Номер карты": ["*7197", "*4556", "*7197", "*7197", "*4556", "*4556"],
                "Сумма операции": [-100, -200, -300, -500, -1000, 2000],
                "Категория": [
                    "Каршеринг", "Мобильная связь", "Мобильная связь", "Супермаркеты", "Супермаркеты", "Каршеринг"
                ],
                "Описание": [
                    "Rumyanyj Khleb",
                    "Я МТС +7 921 11-22-33",
                    "beeline +7 903 438 91 72",
                    "Магнит",
                    "Колхоз",
                    "Ситидрайв"
                ],
            })
    return df
